In [38]:
from faker import Faker
import pandas as pd

In [39]:
fake = Faker()
dept = ['GOOG', 'AAPL', 'MSFT', 'AMZN', 'FB', 'INSTA', 'AIRBNB', 'UBER', 'LYFT', 'TWTR', 'TSLA', 'NFLX', 'SPOT', 'SNAP', 'PINS', 'ZM', 'WORK', 'SQ', 'SHOP', 'BYND']
dept_name = ['Google', 'Apple', 'Microsoft', 'Amazon', 'Facebook', 'Instagram', 'Airbnb', 'Uber', 'Lyft', 'Twitter', 'Tesla', 'Netflix', 'Spotify', 'Snapchat', 'Pinterest', 'Zoom', 'Slack', 'Square', 'Shopify', 'Beyond Meat']

# generate fake name
new = [None] * 1000

for i in range(0, 1000):
    new[i] = fake.name()
    
# genearte fake email
new1 = [None] * 1000

for i in range(0, 1000):
    new1[i] = fake.email()
    
# create fake department
new2 = [None] * 1000
new3 = [None] * 1000

for i in range(0, 1000):
    if i <= 50:
        new2[i] = dept[0]
        new3[i] = dept_name[0]
    elif i <= 100:
        new2[i] = dept[1]
        new3[i] = dept_name[1]
    elif i <= 150:
        new2[i] = dept[2]
        new3[i] = dept_name[2]
    elif i <= 200:
        new2[i] = dept[3]
        new3[i] = dept_name[3]
    elif i <= 250:
        new2[i] = dept[4]
        new3[i] = dept_name[4]
    elif i <= 300:
        new2[i] = dept[5]
        new3[i] = dept_name[5]
    elif i <= 350:
        new2[i] = dept[6]
        new3[i] = dept_name[6]
    elif i <= 400:
        new2[i] = dept[7]
        new3[i] = dept_name[7]
    elif i <= 450:
        new2[i] = dept[8]
        new3[i] = dept_name[8]
    elif i <= 500:
        new2[i] = dept[9]
        new3[i] = dept_name[9]
    elif i <= 550:
        new2[i] = dept[10]
        new3[i] = dept_name[10]
    elif i <= 600:
        new2[i] = dept[11]
        new3[i] = dept_name[11]
    elif i <= 650:
        new2[i] = dept[12]
        new3[i] = dept_name[12]
    elif i <= 700:
        new2[i] = dept[13]
        new3[i] = dept_name[13]
    elif i <= 750:
        new2[i] = dept[14]
        new3[i] = dept_name[14]
    elif i <= 800:
        new2[i] = dept[15]
        new3[i] = dept_name[15]
    elif i <= 850:
        new2[i] = dept[16]
        new3[i] = dept_name[16]
    elif i <= 900:
        new2[i] = dept[17]
        new3[i] = dept_name[17]
    elif i <= 950:
        new2[i] = dept[18]
        new3[i] = dept_name[18]
    else:
        new2[i] = dept[19]
        new3[i] = dept_name[19]
        
# create fake id
new4 = [None] * 1000

for i in range(0, 1000):
    new4[i] = fake.vin()

In [40]:
data = pd.DataFrame({'id': new4, 'name': new, 'email': new1, 'dept': new2, 'dept_name': new3})
data.head()

,id,name,email,dept,dept_name
0,8VC7CRX47MVSZW2XE,Alexander Huber,vmaldonado@example.net,GOOG,Google
1,8WTYAKK88X2K665C1,Laura Thompson,caitlin98@example.org,GOOG,Google
2,W5D3ZLSY6U048CJSG,Rhonda Roberts,weeksdillon@example.org,GOOG,Google
3,LB1YLAX90GRX204CY,Cameron Austin,elijahwilliamson@example.com,GOOG,Google
4,H6CDSARM6NUEELBC2,Brad Evans,wilsonjay@example.com,GOOG,Google

In [41]:
data.shape

(1000, 5)

In [42]:
# create fake system access

system = ['KLSE', 'NASDAQ', 'NYSE', 'SGX', 'HKEX', 'LSE', 'TSE', 'SSE', 'BSE', 'ASX', 'JSE', 'BME', 'FWB', 'BIST', 'B3', 'MOEX', 'TWSE', 'BVL', 'IDX', 'SET']

from random import randrange

new5 = []
id = []
name = []
email = []
dept = []
dept_name = []

for i in range(0, len(data)):
    key = randrange(10)
    for j in range(0, key):
        new5.append(system[j])
        id.append(data['id'][i])
        name.append(data['name'][i])
        email.append(data['email'][i])
        dept.append(data['dept'][i])
        dept_name.append(data['dept_name'][i])

In [43]:
df = pd.DataFrame({'id': id, 'name': name, 'email': email, 'dept': dept, 'system': new5, 'dept_name': dept_name})
df = df.dropna()
df.head()

,id,name,email,dept,system,dept_name
0,8VC7CRX47MVSZW2XE,Alexander Huber,vmaldonado@example.net,GOOG,KLSE,Google
1,8VC7CRX47MVSZW2XE,Alexander Huber,vmaldonado@example.net,GOOG,NASDAQ,Google
2,8WTYAKK88X2K665C1,Laura Thompson,caitlin98@example.org,GOOG,KLSE,Google
3,8WTYAKK88X2K665C1,Laura Thompson,caitlin98@example.org,GOOG,NASDAQ,Google
4,8WTYAKK88X2K665C1,Laura Thompson,caitlin98@example.org,GOOG,NYSE,Google

In [44]:
print(df.shape)

(4619, 6)

In [45]:
df.to_csv('fakedata.csv', index=False)

In [46]:
# create fake hr data
# we will randomly select 200 staffs and make them resign from the company

new6 = []

for i in range(0, 200):
    new6.append(randrange(1000))
    
hr_data = data.drop(index = new6)
hr_data.head()

,id,name,email,dept,dept_name
0,8VC7CRX47MVSZW2XE,Alexander Huber,vmaldonado@example.net,GOOG,Google
1,8WTYAKK88X2K665C1,Laura Thompson,caitlin98@example.org,GOOG,Google
2,W5D3ZLSY6U048CJSG,Rhonda Roberts,weeksdillon@example.org,GOOG,Google
3,LB1YLAX90GRX204CY,Cameron Austin,elijahwilliamson@example.com,GOOG,Google
4,H6CDSARM6NUEELBC2,Brad Evans,wilsonjay@example.com,GOOG,Google

In [47]:
hr_data.shape

(819, 5)

In [48]:
hr_data.to_csv('fake_hr_data.csv', index=False)

In [49]:
# we want to check the difference between hr data and data
# we will use the id to check the difference
hr_data.reset_index(drop=True, inplace=True)
hr_data['id'].isin(data['id']).value_counts()

id
True    819
Name: count, dtype: int64